content/it/docs/80 Progetti/ProgettoMipaf/Esempi di XML per la modalita_web-service/Produzione burro/Sincroni/VisProdSiRPBu.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://cooperazione.sian.it/schema/SoapAutenticazione" xmlns:wsm="http://cooperazione.sian.it/schema/wsmrge/">
   <soapenv:Header>
      <soap:SOAPAutenticazione>
         <!--Credenziali rilasciate dal Ministero all'azienda-->
         <username>AAAAAAAAAA</username>
         <password>BBBBBBBBBB</password>
          <nomeServizio>VisProdSiRPBu</nomeServizio>
      </soap:SOAPAutenticazione>
   </soapenv:Header>
   <soapenv:Body>
      <wsm:VisProdSiRPBuInput>
         <wsm:codOper>
            <!--Indicazione del Codice Fiscale dell'azienda (valorizzare tag persona fisica o giuridica)-->
            <wsm:PersonaGiuridica>01234567890</wsm:PersonaGiuridica>
        </wsm:codOper>
         <!--Codice ICQRF dello stabilimento nel formato AANNNN-->
         <wsm:CodiceIcqrf>RM1234</wsm:CodiceIcqrf>
         <wsm:SituazioneGiacenza>
            <!--Data della giacenza nel formato AAAA-MM-GG-->
            <wsm:Data>2015-10-18</wsm:Data>
         </wsm:SituazioneGiacenza>
      </wsm:VisProdSiRPBuInput>
   </soapenv:Body>
</soapenv:Envelope>